# see https://github.com/Homebrew/homebrew-bundle
cask_args appdir: "/Applications"

######################################################################
# The development, console and server stuff                          #
######################################################################

brew "git"
brew "git-extras"
#brew "git-flow"
#brew "curl"
#brew "tree"
#brew "openssl"
#brew "wget"
brew "mariadb"
cask "db-browser-for-sqlite"
cask "sequel-pro"
cask "virtualbox"
cask "vagrant"
cask "transmit"
cask "postman"

# ==== Some version control tools you might like ====
# cask "github-desktop"
# cask "tower"
# cask "sourcetree"

# ==== not the best native experience in OSX ====
# brew "docker"
# brew "docker-machine"

# ==== VPN Connections ====
# cask "tunnelbear"
cask "tunnelblick"

######################################################################
# Everything PHP related                                             #
######################################################################

# High Sierra comes with PHP 7.1 bundled, which is excellent - so I will stick with that one

tap "homebrew/homebrew-php"
brew "homebrew/php/composer"
brew "homebrew/php/php-code-sniffer"
brew "homebrew/php/php-cs-fixer"

######################################################################
# Licensed software                                                  #
######################################################################

cask "phpstorm"
cask "gemini"
cask "cleanmymac"
cask "hyperdock"
cask "powerphotos"
cask "moneymoney"

# no license for 6 yet, so we install the latest v5
# cask "istat-menus"
cask "https://raw.githubusercontent.com/caskroom/homebrew-cask/3a68e11fa578e36fe4745d761a6082b0b158391b/Casks/istat-menus.rb"

cask "sublime-text"

# subversion is oldschool, try to avoid it by any means
# cask "versions"

######################################################################
# Shell: iTerm2, zsh, oh-my-zsh plugins and themes                   #
######################################################################

cask "iterm2"
brew "zsh"
brew "zsh-autosuggestions"

tap "caskroom/fonts"
cask "font-menlo-for-powerline"
brew "zsh-autosuggestions"

######################################################################
# (Text-)Editors                                                     #
######################################################################

cask "atom"

# maybe not for your everyday work
# cask "gitbook"
# cask "poedit"
# cask "macdown"

# textwrangler is no longer available and became part of bbedit
# cask "bbedit"

######################################################################
# Everyday tools / Cloud / Communication                             #
######################################################################

cask "commander-one"

# google is enough spyware for one computer ;-)
# cask "dropbox"

cask "google-backup-and-sync"

cask "skype"
cask "slack"
cask "vlc"
cask "libreoffice"
cask "handbrake"
cask "cheatsheet"

# cask "keepassx"               # I prefer MacPass due to its much nicer UI
cask "macpass"

# cask "google-hangouts"
# cask "grandperspective"
# cask "calibre"
# cask "handbrake"
# cask "steam"
# cask "flash"

# cask "spectacle"              # Spectacle is free and has window resizing and snapping features, but I use HyperDock

# cask "the-unarchiver"		    # don't know which one ...
# cask "keka"			        # ... is the better un-archiver, so try any of them

#cask "aerial"                   "# screensaver showing the AppleTV aerial videos

######################################################################
# Drivers                                                            #
######################################################################

tap "caskroom/drivers"
cask "canon-pixma-scanner-driver-ica"     # for my Canon MG5350 printer

######################################################################
# Browser                                                            #
######################################################################

cask "firefox"
cask "google-chrome"
# cask "chromium"
# cask "firefoxnightly"
# cask "google-chrome-canary"
# cask "opera"

######################################################################
# Image editing and manipulation                                     #
######################################################################

cask "macsvg"
# cask "gimp"                   # almost too much for the simple tasks
# cask "seashore"               # simple image editing for everyone
# cask "imageoptim"             # shrinking all kinds of images
# cask "imagealpha"             # PNG optimizer

######################################################################
# Quick Look Plugins                                                 #
######################################################################

# see https://github.com/sindresorhus/quick-look-plugins

#cask "qlcolorcode"
#cask "qlstephen"
#cask "qlmarkdown"
#cask "quicklook-json"
#cask "qlprettypatch"
#cask "quicklook-csv"
#cask "betterzipql"
#cask "qlimagesize"
#cask "webpquicklook"
#cask "suspicious-package"       # http://www.mothersruin.com/software/SuspiciousPackage/

######################################################################
# TESTING ...                                                        #
######################################################################

cask "gmvault"                  # backup & restore gmail accounts

# Software I might use occasionally or did not test thoroughly enough to activate by default
#
# cask "elmedia-player"         # vlc alternative with airplay support
# cask "dash"                   # developer documentation offline
# cask "silverlight"            # microsoft libs that we hopefully don't need
# cask "quicksilver"            # productivity app (a better Spotlight)
# cask "glimmerblocker"         # proxy for ad-blocking
# cask "flux"                   # dim screen color at night
# cask "screenflow"             # screencast recorder
# cask "itunes-volume-control"  # control itunes volume with keyboard and apple remote
# cask "osxfuse"                # add fuse filesystems
# cask "gpgtools"
# cask "dockertoolbox"
