# see https://github.com/Homebrew/homebrew-bundle
cask_args appdir: "/Applications"

######################################################################
# The development, console and server stuff                          #
######################################################################

brew "git"
brew "git-extras"
brew "git-flow"
brew "curl"
brew "tree"
brew "openssl"
brew "wget"

brew "mariadb"
brew "docker"
brew "docker-machine"

######################################################################
# Everything PHP related                                             #
######################################################################

tap "homebrew/homebrew-php"
brew "homebrew/php/composer"
brew "homebrew/php/php-code-sniffer"
brew "homebrew/php/php-cs-fixer"

cask "phpstorm"

######################################################################
# Shell: iTerm2, zsh, oh-my-zsh, plugins and themes                  #
######################################################################

cask "iterm2"
brew "zsh"
brew "zsh-autosuggestions"

tap "caskroom/fonts"
cask "font-menlo-for-powerline"
brew install zsh-autosuggestions
brew "zsh-autosuggestions"

######################################################################
# And now the Applications with UI                                   #
######################################################################

cask "dropbox"
cask "google-drive"
cask "sequel-pro"
cask "firefox"
cask "google-chrome"
cask "virtualbox"
cask "vagrant"
cask "atom"
cask "textwrangler"
cask "skype"
cask "google-hangouts"
cask "slack"
cask "vlc"
cask "transmit"
cask "istat-menus"
cask "gitbook"
cask "poedit"
cask "macdown"
cask "libreoffice"
cask "handbrake"
cask "google-photos-backup"
cask "grandperspective"
cask "moneymoney"
cask "calibre"
cask "handbrake"
cask "steam"
cask "flash"

# (Not only) frontend devs might like these as well
# cask "firefoxnightly"
# cask "google-chrome-canary"
# cask "opera"

# Not sure which (un-)archiver is better
cask "the-unarchiver"
cask "keka"

# Image editing and manipulation
# cask "gimp"                   # almost too much for the simple tasks
# cask "seashore"               # simple image editing for everyone
cask "imageoptim"               # shrinking all kinds of images
cask "imagealpha"               # PNG optimizer

# cask "spectacle"              # Spectacle is free and has window resizing and snapping features
cask "hyperdock"                # ... where HyperDock has more features but requires a license

# cask "keepassx"               # I prefer MacPass due to its much nicer UI
cask "macpass"

# Some version control tools you might like
# cask "github-desktop"
# cask "tower"
cask "versions"
cask "sourcetree"

# Quick Look Plugins, see https://github.com/sindresorhus/quick-look-plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlprettypatch"
cask "quicklook-csv"
cask "betterzipql"
cask "qlimagesize"
cask "webpquicklook"
cask "suspicious-package"       # http://www.mothersruin.com/software/SuspiciousPackage/

# Software I might use occasionally or did not test thoroughly enough to activate by default
#
# cask "elmedia-player"         # vlc alternative with airplay support
# cask "dash"                   # developer documentation offline
# cask "silverlight"            # microsoft libs that we hopefully don't need
# cask "quicksilver"            # productivity app (a better Spotlight)
# cask "tunnelbear"             # vpn
# cask "glimmerblocker"         # proxy for ad-blocking
# cask "flux"                   # dim screen color at night
# cask "screenflow"             # screencast recorder
# cask "itunes-volume-control"  # control itunes volume with keyboard and apple remote
# cask "osxfuse"                # add fuse filesystems
# cask "gpgtools"
# cask "dockertoolbox"
